Repository: neonatool/adftool
Catalog: po/*.po
Languages: fr

source: Initialize the term as a typed literal string.
fr: Initialise le terme comme chaîne littérale typée.

source: Initialize the term as a lang-tagged string.
fr: Initialise le terme comme chaîne languo-taggée.

source: Initialize the term as a literal integer.
fr: Initialise le terme comme entier littéral.

source: Initialize the term as a literal double.
fr: Initialise le terme comme double littéral.

source: Initialize the term as a literal date with the number of seconds since the epoch, and the number of nanoseconds.
fr: Initialise le terme comme une date littérale avec le nombre de secondes depuis l’époque, et le nombre de nanosecondes.

source: Check whether the term is a blank node.
fr: Vérifie si le term est un nœud blanc.

source: Check whether the term is a named node.
fr: Vérifie si le term est un nœud nommé.

source: Check whether the term is a literal node.
fr: Vérifie si le terme est un nœud littéral.

source: Check whether the term is a literal node with a type (as opposed to a langtag).
fr: Vérifie si le terme est un nœud littéral avec type (contrairement au langtag)

source: Check whether the term is a literal node with a language tag.
fr: Vérifie si le terme est un nœud littéral avec un tag de langue.

source: Return the value of the term.
fr: Retourne la valeur du terme.

source: Return the type or langtag.
fr: Retourne le type ou languotag.

source: Try and convert the term as an integer. Return a 0-length array if it cannot be converted, or a 1-integer-long array if it can.
fr: Essaye de convertir le terme en entier. Retourne un tableau vide à défaut, ou un tableau de 1 entier si c’est possible.

source: Try and convert the term as a double. Return a 0-length array if it cannot be converted, or a 1-double-long array if it can.
fr: Essaye de convertir le terme en double. Retourne un tableau vide à défaut, ou un tableau de 1 double si c’est possible.

source: Try and convert the term as a date. Return an empty list if the conversion failed, or a list with keys "tv_sec" and "tv_nsec" otherwise.
fr: Essaye de convertir le terme en date. Retourne une liste vide en cas d’échec, ou une liste avec les clés « tv_sec » et « tv_nsec » sinon.

source: Compare the term order with the other term. Return a negative number if the main term comes before the other term, a positive number if it comes after, and 0 if both terms are equal.
fr: Compare l’ordre du terme avec le terme other. Retourne un nombre négatif si le terme principal vient avant le terme other, un nombre positif si il vient après, et 0 s’ils sont égaux.

source: Try and parse the string as a N3 term. If successful, return a list with "success" set to TRUE and "rest" set to the suffix that has not been used by the parser. Otherwise, return a list with "success" set to FALSE.
fr: Essaye de lire la chaîne comme terme N3. En cas de réussite, retourne une liste avec « success » valant TRUE et « rest » le suffixe qui n’a pas été lu. Sinon, retourne une liste où « success » vaut FALSE.

source: Return as a string the N3 encoding of the term.
fr: Retourne comme chaîne l’encodage N3 du terme.

source: Construct a new, empty pattern.
fr: Construit un nouveau motif vide.

source: Copy the other pattern.
fr: Copie le motif other.

source: Initialize parts of the pattern from the argument, a list. For each of the keys, subject, predicate, object and graph, if the list has a value, set the corresponding term. The value can be FALSE to unset the term, or a valid term object to replace it. If the list has a value for the deletion_date key, then also set the deletion date. If the deletion date is FALSE, then undelete the statement. Otherwise, set its deletion date.
fr: Initialise certaines parties du motif à partir de l’argument liste. Pour chaque clé subject, predicate, object et graph, si la liste a une valeur, initialise le terme correspondant. La valeur peut être FALSE pour réinitialiser le terme, ou un terme valide pour le remplacer. Si la liste a une valeur pour la clé deletion_date, initialise aussi la date de suppression. Si la date de suppression est FALSE, dé-supprime la déclaration. Sinon, initialise la date de suppression.

source: Return all the terms as a named vector.
fr: Retourne tous les termes dans un vecteur nommé.

source: Return the deletion date as numeric vector. If there is no deletion date, return an empty numeric vector.
fr: Retourne la date de suppression en vecteur numérique. S’il n’y a pas de date, retourne un vecteur numérique vide.

source: Compare the pattern order with the other pattern. Return a negative number if the main pattern comes before the other pattern, a positive number if it comes after, and 0 if both patterns overlap. The order is a lexicographic order, but the order of the terms to compare can be parametrized. For instance, "GSPO" compares the graphs, then subjects, then predicates, then objects.
fr: Compare l’ordre du motif avec le motif other. Retourne un nombre négatif si le motif principal vient avant le motif other, un nombre positif si il vient après, et 0 si les motifs se recouvrent partiellement. L’ordre est un ordre lexicographique, mais l’ordre des termes comparés peut être paramétré. Par exemple, « GSPO » compare les graphes, puis les sujets, puis les prédicats, puis les objets.

source: Construct a band-pass filter, acting on a signal of the given sampling frequency, and letting through frequencies from low to high.
fr: Construit un filtre passe-bande agissant sur un signal de fréquence d’échantillonnage donné, laissant passer les fréquences entre low et high.

source: Construct a band-pass filter, acting on a signal of the given sampling frequency, and letting through frequencies from low to high, by specifying the low and high transition bandwidths.
fr: Construit un filtre passe-bande agissant sur un signal de fréquence d’échantillonnage donné, laissant passer les fréquences entre low et high.

source: Return the coefficients of the filter.
fr: Retourne les coefficients du filtre.

source: Apply the filter on new data.
fr: Applique le filtre sur de nouvelles données.

source: Open a file on disk.
fr: Ouvre un fichier sur le disque.

source: Open an anonymous file on disk with initial data.
fr: Ouvre un fichier anonyme sur le disque avec des données initiales.

source: Open an anonymous file on disk with synthetic data.
fr: Ouvre un fichier anonyme sur le disque avec des données synthétiques.

source: Close the file early.
fr: Ferme le fichier immédiatement.

source: Return the file contents as bytes.
fr: Retourne les octets du contenu du fichier.

source: Search for a pattern in file, return all the matches.
fr: Recherche un motif dans le fichier, retourne toutes les correspondances.

source: Search for all objects in the file that are related to the subject by predicate, return all the matches.
fr: Recherche tous les objets du fichier qui sont reliés au sujet par le prédicat, retourne toutes les correspondances.

source: Search for all subjects in the file that are related to the objects by predicate, return all the matches.
fr: Recherche tous les sujets du fichier qui sont reliés à l’objet par le prédicat, retourne toutes les correspondances.

source: Return all the integer properties of the subject in file for the predicate.
fr: Retourne toutes les propriétés entières du sujet dans le fichier pour le prédicat.

source: Return all the numeric properties of the subject in file for the predicate.
fr: Retourne toutes les propriétés numériques du sujet dans le fichier pour le prédicat.

source: Return all the date properties of the subject in file for the predicate.
fr: Retourne toutes les propriétés de date du sujet dans le fichier pour le prédicat.

source: Return all the possibly lang-tagged property values of the subject in file for the predicate. Return them as a list of string vectors, named by the langtags. The non-tagged strings have an empty name.
fr: Retourne toutes les propriétés textuelles possiblement lang-tagguées du sujet dans le fichier pour le prédicat. Les valeurs sont retournées comme liste de vecteurs textuels, nommées par les langtags. Les chaînes non-langtagguées ont un nom vide.

source: Try and delete all statements that match a pattern in file. Return wether it succeeded.
fr: Essaye de supprimer toutes les déclarations correspondant au motif dans le fichier. Indique par la valeur de retour si ça a marché.

source: Try and insert a new statement in file. Return wether it succeeded.
fr: Essaye d’ajouter une nouvelle déclaration dans le fichier. Indique par la valeur de retour si ça a marché.

source: Try and set all the EEG data at once. Return wether it succeeded. The data must be row-oriented.
fr: Essaye de définir toutes les données EEG d’un coup. Indique par la valeur de retour si ça a marché. Les données doivent être orientées ligne.

source: Read a temporal slice of a channel. If the request is larger than what is available, fill the rest with NAN values. The return value is a list, with key n bound to the number of time points available, p bound to the total number of channels, and data bound to the requested data.
fr: Lit une section temporelle d’un canal. Si la requête est plus large que ce qui est disponible, remplit le reste avec des valeurs NAN. La valeur de retour est une liste, avec la clé n associée au nombre de points temporels disponibles, p associée au nombre total de canaux, et data associée aux données demandées.

source: Libbplus test suite
fr: Suite de test libbplus

source: Fetching a node
fr: Récupération d’un nœud

source: Finding a key with dichotomy
fr: Trouver une clé par dichotomie

source: Search step for both first and last occurence of a key
fr: Étape de recherche simultanée pour la première et dernière occurence d’une clé

source: Check the range iterator
fr: Vérifier l’itérateur d’intervalle

source: Check the recursive key finder
fr: Vérifier la recherche de clé récursive

source: Fix the children’s parent
fr: Réattacher le parent des enfants

source: Grow the B+ tree
fr: Agrandir l’arbre B+

source: Fetch the parent of a node
fr: Récupérer le parent d’un nœud

source: Give some of your keys to a new node
fr: Donner quelques-unes de vos clés à un nouveau nœud

source: Insert in the B+ tree
fr: Insertion dans l’arbre B+

source: Insert in the B+ tree with the pull API
fr: Insertion dans l’arbre B+ avec l’API pull

source: HDF5 callbacks for the API
fr: Fonctions de rappel HDF5

source: Could not get the current time.
fr: Impossible de récupérer la date courante.

source: Could not set the time and sampling frequency.
fr: Impossible de définir la date et la fréquence d’échantillonnage.

source: Could not compute the date of the first observation.
fr: Impossible de calculer la date de la première observation.

source: Could not compute the date of the second observation.
fr: Impossible de calculer la date de la seconde observation.

source: Could not compute the date of the third observation.
fr: Impossible de calculer la date de la troisième observation.

source: The dictionary does not know %s.
fr: Le dictionnaire ne connaît pas %s.

source: The dictionary put %s in position %u, not %lu.
fr: Le dictionnaire a mis %s en position %u, pas %lu.

source: Not enough memory to allocate a term.
fr: Pas assez de mémoire pour allouer un terme.

source: Failed to encode term %lu.
fr: Impossible d’encoder le terme %lu.

source: Encoding term %lu gives %016lx, not %016lx.
fr: L’encodage du terme %lu donne %016lx, pas %016lx.

source: Failed to decode term %lu (%016lx).
fr: Impossible de décoder le terme %lu (%016lx).

source: Term %lu is not decoded properly (%016lx).
fr: Le terme %lu n’a pas été décodé proprement (%016lx).

source: The test failed, keeping encoding_unit_test.adf around.
fr: Le test a échoué, gardons unit_test.adf.

source: Error: the filter order is %lu != %lu.
fr: Erreur_: l’ordre du filtre est %lu ≠ %lu.

source: The filter test failed (%f).
fr: Le test du filtre a échoué (%f).

source: The filter result is not great but at least it is closer to the expected result than to the raw signal.
fr: Le résultat du filtre n’est pas génial mais au moins il est plus proche du résultat attendu que du signal original.

source: I don’t know how to represent namespaced terms yet, sorry.
fr: Je ne supporte pas encore les données avec un espace de nom.

source: Could not extend the dataset.
fr: Impossible d’étendre le jeu de données.

source: Type %lu for number %lu is %d, should be %d.
fr: Le type %lu pour le numéro %lu est %d, mais devrait être %d.

source: Term %lu cannot be encoded to N3 in less than 256 characters (%lu required).
fr: Le terme %lu ne peut pas être encodé en N3 avec moins de 256 caractères (%lu sont nécessaires).

source: Term %lu N3 encoding is not correct: %s vs expected %s.
fr: L’encodage du terme %lu en N3 n’est pas correct : %s vs %s attendu.

source: Value for number %lu (%s) is %s, should be %s.
fr: La valeur pour le numéro %lu (%s) est %s, mais devrait être %s.

source: Meta for number %lu (%s) is %s, should be %s.
fr: La méta pour le numéro %lu (%s) est %s, mais devrait être %s.

source: Comparison between %lu (%s) and %lu (%s) should be %d, it is %d.
fr: La comparaison entre %lu (%s) et %lu (%s) devrait être %d, c’est %d.

source: The test failed, keeping term_example.adf around.
fr: Le test a échoué, gardons term_exemple.adf.
