Repository: neonatool/adftool
Catalog: po/*.po
Languages: fr

source: Not enough memory.
fr: Pas assez de mémoire.

# Command-line|Option|
source: lookup
fr: chercher

# Command-line|Option|
source: add
fr: ajouter

# Command-line|Option|
source: remove
fr: enlever

# Command-line|Option|
source: get-eeg-data
fr: obtenir-données-eeg

# Command-line|Option|
source: set-eeg-data
fr: définir-données-eeg

# Command-line|Option|
source: find-channel-identifier
fr: identifiant-du-canal

# Command-line|Option|
source: channel-metadata
fr: métadonnées-du-canal

# Command-line|Option|
source: add-channel-type
fr: ajouter-type-de-canal

# Command-line|Option|
source: channels-of-type
fr: canaux-de-type

# Command-line|Option|
source: eeg-metadata
fr: métadonnées-eeg

# Command-line|Option|
source: set-eeg-date
fr: modifier-date-eeg

# Command-line|Option|
source: subject
fr: sujet

# Command-line|Option|
source: predicate
fr: prédicat

# Command-line|Option|
source: object
fr: objet

# Command-line|Option|
source: graph
fr: graphe

# Command-line|Option|
source: deletion-date
fr: date-de-suppression

# Command-line|Option|
source: help
fr: aidez-moi

source: The argument to "%s" must be a number.
fr: L’argument de « %s » doit être un nombre.

source: The argument to "%s" must be a N3 identifier.
fr: L’argument de « %s » doit être un identifiant N3.

source: The argument to "%s" must be in the form of IDENTIFIER=TYPE.
fr: L’argument de « %s » doit être de la forme IDENTIFIANT=TYPE.

source: The argument to "%s" must be in the form of DATE,SAMPLING_FREQUENCY.
fr: L’argument de « %s » doit être de la forme DATE,FRÉQUENCE_D’ÉCHANTILLONNAGE.

source: The DATE argument to "%s" must be a date according to XSD.
fr: L’argument DATE de « %s » doit être une date selon XSD.

source: The SAMPLING_FREQUENCY argument to "%s" must be a number.
fr: L’argument FRÉQUENCE_D’ÉCHANTILLONNAGE de « %s » doit être un nombre.

source: The argument to "%s" cannot be parsed as a N-Triples term: "%s"
fr: L’argument de « %s » ne peut pas être compris comme un terme N-Triples : « %s »

source: Warning: the argument to "%s" can be parsed as a N-Triples term, but the trailing "%s" will be discarded.
fr: Attention : l’argument de « %s » peut être interprété comme un terme N-Triples, mais la fin « %s » sera ignorée.

source: Usage: [ENVIRONMENT…] adftool [OPTION…] FILE Read or update FILE.
fr: Utilisation : [ENVIRONNEMENT…] adftool [OPTION…] FICHIER Lit ou modifie FICHIER.

source: You can set a pattern in N-Triples format: -s NT, --%s=NT; -p NT, --%s=NT; -o NT, --%s=NT; -g NT, --%s=NT. You use this pattern to: --%s: print the data matching the pattern; --%s: add the statement (only graph is optional); --%s: remove all statements matching the pattern.
fr: Vous pouvez sélectionner un motif au format N-Triples : -s NT, --%s=NT_; -p NT, --%s=NT ; -o NT, --%s=NT ; -g NT, --%s=NT. Vous pouvez utiliser ce motif pour : --%s : afficher les données qui correspondent au motif ; --%s : ajouter la déclaration (seul le graphe est optionnel) ; --%s : enlever toutes les déclarations qui correspondent au motif.

source: There are other operation modes for adftool:
fr: Il y a d’autres modes d’opération pour adftool_:

source: --%s: read the raw EEG sensor data (in Tab-Separated Value [TSV] format);
fr: --%s : lit les données brutes du capteur EEG (au format Valeurs Séparées par des Tabulations [TSV en anglais]) ;

source: --%s: set the raw EEG sensor data (in TSV format) from the standard input;
fr: --%s : définit les données brutes de capteur EEG (au format TSV) à partir de l’entrée standard ;

source: --%s: read the EEG metadata;
fr: --%s : lit les métadonnées de l’EEG ;

source: --%s=DATE,SAMPLING_FREQUENCY: set the EEG date and sampling frequency (DATE is in the format of %s, and SAMPLING_FREQUENCY in the locale numeric format, %f);
fr: --%s=DATE,FRÉQUENCE_D’ÉCHANTILLONNAGE : modifie la date de l’EEG et la fréquence d’échantillonnage (DATE est au format de %s, et FRÉQUENCE_D’ÉCHANTILLONNAGE dans le format numéric local, %f) ;

source: --%s=COLUMN: find the channel identifier for the raw sensor data in COLUMN (an integer);
fr: --%s=COLONNE : trouve l’identifiant de canal pour les données brutes du capteur dans COLONNE (un entier) ;

source: --%s=IDENTIFIER: read the channel metadata for IDENTIFIER (in N3);
fr: --%s=IDENTIFIANT : lit les métadonnées du canal IDENTIFIANT (au format N3) ;

source: --%s=IDENTIFIER=TYPE: add TYPE to the list of types for IDENTIFIER (both in N3);
fr: --%s=IDENTIFIANT=TYPE : ajoute TYPE à la liste des types de IDENTIFIANT (tous les deux au format N3) ;

source: --%s=TYPE: print the list of channels of type TYPE (in N3).
fr: --%s=TYPE : affiche la liste des canaux de type TYPE (au format N3).

source: There are other options: -d DATE, --%s=DATE: use DATE instead of the current date when deleting statements. -h, --%s: print this message and exit. -V, --%s: print the package version and exit.
fr: Il y a d’autres options : -d DATE, --%s=DATE : utiliser la DATE à la place de la date courante pour la suppression de déclarations. -h, --%s : afficher ce message et quitter. -V, --%s : afficher la version du paquet et quitter.

source: The following environment variables can change the behavior of the program: LANG: change the localization. Set it as "LANG=C" in the environment or "LANG=en_US.UTF-8" to disable localization. LC_NUMERIC: change the expected number format to input and output numbers. Set it as "LC_NUMERIC=C" or "LC_NUMERIC=en_US.UTF-8" to use the English notation.
fr: Les variables d’environnement suivantes peuvent changer le comportement du programme : LANG_: change la localisation. La définir avec la valeur « LANG=C » dans l’environnement ou « LANG=en_US.UTF-8 » désactive la localisation ; LC_NUMERIC : change le format numérique attendu pour la lecture et l’écriture de nombres. Définissez-le avec « LC_NUMERIC=C » ou « LC_NUMERIC=en_US.UTF-8 » pour utiliser la notation anglaise.

source: Please note that TSV exchange of raw EEG data uses the current numeric locale format. For instance, here is an approximation of π: "%f". You can control the numeric format by setting the LC_NUMERIC environment variable. For instance, if the EEG data has been generated within the English locale, you would set it with the following command-line: LC_NUMERIC=en_US.UTF-8 adftool --%s file.adf And then specify the data in this format: 0.01 3.42e-4 -1.18e2 3.1416 … …
fr: Veuillez noter que l’échange de données brutes EEG par TSV utilise le format local numérique courant. Par exemple, voici une approximation de π : « %f ». Vous pouvez contrôler le format numérique en définissant la variable d’environnement LC_NUMERIC. Par exemple, si les données EEG ont été générées à partir d’une locale anglaise, vous pouvez les écrire avec la ligne de commande suivante : LC_NUMERIC=en_US.UTF-8 adftool --%s fichier.adf Et spécifier par la suite les données dans ce format : 0.01 3.42e-4 -1.18e2 3.1416 … …

source: Here is a summary of the current values of the main environment variables:
fr: Voici un résumé des valeurs actuelles des principales variables d’environnement_:

source: %s is unset
fr: %s n’est pas définie

source: %s Copyright status is unclear.
fr: %s Le copyright n’est pas clair.

source: No file to process.
fr: Aucun fichier à traiter.

source: Nothing to do.
fr: Rien à faire.

source: Conflicting operations: please pass either --%s, --%s, --%s, --%s or --%s.
fr: Opérations conflictuelles : veuillez passer soit --%s, soit --%s, soit --%s, soit --%s, soit --%s.

# Command-line|Option|
source: insert
fr: ajouter

source: Conflicting operations: please pass either --%s, --%s, --%s or --%s.
fr: Opérations conflictuelles : veuillez passer soit --%s, soit --%s, soit --%s, soit --%s.

source: The file "%s" could not be opened.
fr: Le fichier « %s » n’a pas pu être ouvert.

source: Error: could not get the current time.
fr: Impossible de récupérer la date courante.

source: Could not insert the data.
fr: Impossible d’ajouter les données.

source: Could not delete the data.
fr: Impossible de supprimer les données.

source: Could not read the EEG data.
fr: Impossible de lire les données EEG.

source: Error: input line %lu contains "%s", which cannot be parsed as a number.
fr: Erreur_: la ligne d’entrée %lu contient « %s », qui ne peut pas être interprété comme un nombre.

source: You may need to set LC_NUMERIC. Please run adftool --%s to read more about numeric data formats.
fr: Vous devrez peut-être définir LC_NUMERIC. Veuillez exécuter adftool --%s pour en apprendre plus sur les formats de données numériques.

source: Error: input line %lu has %lu values, but there are %lu columns.
fr: Erreur_: la ligne d’entrée %lu a %lu valeurs, mais il y a %lu colonnes.

source: Error: cannot set the EEG data.
fr: Erreur : impossible de définir les données EEG.

source: Error: no channel identifier for column %lu.
fr: Erreur_: pas d’identifiant de canal pour la colonne %lu.

source: Metadata of channel %s:
fr: Métadonnées du canal %s :

source: - its data are in column %lu;
fr: - ses données sont dans la colonne %lu ;

source: - its data cannot be found;
fr: - ses données ne peuvent être lues ;

source: - it has no types.
fr: - il n’a pas de type.

source: - it has %lu type:
fr: - il a %lu type :

source: Error: could not add a new type.
fr: Erreur_: impossible d’ajouter un nouveau type.

source: The EEG does not have a start date or a sampling frequency.
fr: L’EEG n’a pas de date ou pas de fréquence d’échantillonnage.

source: The EEG started at: %s, with a sampling frequency of %f Hz.
fr: L’EEG a démarré à : %s, avec une fréquence d’échantillonnage de %f Hz.

source: Could not set the EEG time.
fr: Impossible de modifier la date de l’EEG.

source: Cannot allocate memory to hold the results.
fr: Impossible d’allouer de la mémoire pour les résultats.

source: Cannot list the statements.
fr: Impossible de lister les déclarations.

source: Open the file under the given name. If the write flag is set, open it for reading and writing. Otherwise, open it just for reading.
fr: Ouvre le fichier avec le nom donné. Si le drapeau write est vrai, ouvre le fichier pour la lecture et l’écriture. Sinon, ouvre le fichier juste pour la lecture.

source: Close the opened file.
fr: Ferme le fichier ouvert.

source: Open a virtual file with initial content. The argument is read-only. Use '.get_data()' to return the final content.
fr: Ouvre un fichier virtuel avec un contenu initial. L’argument est disponible uniquement en lecture seule. Utilisez « .get_data » pour obtenir le contenu final.

source: Open a virtual file and populate it with a generated EEG.
fr: Ouvre un fichier virtuel et le remplit avec un EEG généré.

source: Discard the first start bytes, then fill the bytes object with the next bytes of the file. Return the total number of bytes in the file.
fr: Ignore les start premiers octets, puis remplit l’objet bytes avec les octets suivants du fichier. Retourne le nombre total d’octets dans le fichier.

source: Search for statements matching the pattern in the file, discard the first start statements, and fill the results with the next statements. Return the total number of statements that match the pattern.
fr: Cherche des déclarations correspondant au motif pattern dans le fichier, ignore les start première déclarations et remplit results avec les déclarations suivantes. Retourne le nombre total de déclarations qui correspondent au motif.

source: Search for non-deleted objects that match the pattern subject <predicate> ?. Discard the first start statements, and fill the results with the next objects. Return the total number of undeleted objects that match the pattern.
fr: Cherche des objets non supprimés correspondant au motif subjet <prédicat> ?. Ignore les start premières déclarations, et remplit results avec les objets suivants. Retourne le nombre total d’objets non supprimés qui correspondent au motif.

source: Search for non-deleted literal integers that match the pattern subject <predicate> ?. Discard the first start values, and fill the results with the next values. Return the total number of undeleted values that match the pattern.
fr: Cherche des entiers littéraux non supprimés correspondant au motif sujet <prédicat> ?. Ignore les start premières valeurs, et remplit results avec les valeurs suivantes. Retourne le nombre total de valeurs non supprimées qui correspondent au motif.

source: Search for non-deleted literal doubles that match the pattern subject <predicate> ?. Discard the first start values, and fill the results with the next values. Return the total number of undeleted values that match the pattern.
fr: Cherche des double flottants littéraux non supprimés correspondant au motif sujet <prédicat> ?. Ignore les start premières valeurs, et remplit results avec les valeurs suivantes. Retourne le nombre total de valeurs non supprimées qui correspondent au motif.

source: Search for non-deleted literal dates that match the pattern subject <predicate> ?. Discard the first start values, and fill the results with the next values. Return the total number of undeleted values that match the pattern.
fr: Cherche des dates littérales non supprimées correspondant au motif sujet <prédicat> ?. Ignore les start premières valeurs, et remplit results avec les valeurs suivantes. Retourne le nombre total de valeurs non supprimées qui correspondent au motif.

source: Search for non-deleted (possibly langtagged) literal strings that match the pattern subject <predicate> ?. Discard the first start values, and fill the results with the next values. Return the total number of undeleted values that match the pattern.
fr: Cherche des chaînes littérales (possiblement langtagguées) non supprimées correspondant au motif sujet <prédicat> ?. Ignore les start premières valeurs, et remplit results avec les valeurs suivantes. Retourne le nombre total de valeurs non supprimées qui correspondent au motif.

source: Search for non-deleted subjects that match the pattern ? <predicate> object. Discard the first start statements, and fill the results with the next subjects. Return the total number of undeleted subjects that match the pattern.
fr: Cherche des sujets non supprimés correspondant au motif ? <prédicat> object. Ignore les start premières déclarations, et remplit results avec les sujets suivants. Retourne le nombre total de sujets non supprimés qui correspondent au motif.

source: Mark every statement that match the pattern as deleted.
fr: Marque toutes les déclarations correspondant au motif comme supprimées.

source: Insert the new statement in the file.
fr: Ajoute une nouvelle déclaration dans le fichier.

source: Find the term identifying the channel whose data is stored in the given column.
fr: Trouve le terme identifiant le canal dont les données sont stockées dans la colonne donnée.

source: Find in which column the channel data is stored.
fr: Trouve dans quelle colonne sont stockées les données du canal.

source: Add a new type to the channel.
fr: Ajoute un nouveau type de canal.

source: Query all the types for a channel.
fr: Requête tous les types d’un canal.

source: Query all the channels of a specific type.
fr: Requête tous les canaux de ce type.

source: Get the raw EEG data.
fr: Obtient les données EEG brutes.

source: Set all the raw EEG data at once.
fr: Définit l’ensemble des données brutes EEG en une fois.

source: Get the EEG recording time and sampling frequency.
fr: Obtient la date d’enregistrement de l’EEG et la fréquence d’échantillonnage.

source: Set the EEG recording time and sampling frequency.
fr: Modifie la date d’enregistrement de l’EEG et la fréquence d’échantillonnage.

source: Handle to a file on the file system or in memory
fr: Contrôle d’un fichier dans le système de fichier ou en mémoire

source: Set the object to a copy of its argument.
fr: Assigne une copy de l’argument à l’objet.

source: Set the object as an IRI reference.
fr: Assigne une référence d’IRI à l’objet.

source: Set the object as a labeled blank node.
fr: Assigne un nœud blanc étiquetté à l’objet.

source: Set the object as a literal node, with value as its literal value, and either type, langtag, or none of them.
fr: Construit l’objet comme un littéral, avec une valeur littérale, et soit un type, soit un langtag, soit aucun des deux.

source: Set the object as a literal integer.
fr: Assigne un entier à l’objet.

source: Set the object as a literal floating point number.
fr: Assigne un nombre à virgule flottante à l’objet.

source: Set the object as a literal date, a tuple where the first element is the number of seconds since the epoch, and the second element is the number of nanoseconds since the start of the last second.
fr: Construit l’objet comme une date littérale, avec un tuple dont le premier élément est le nombre de secondes depuis l’époque, et dont le second élément est le nombre de nanosecondes depuis le début de la dernière seconde.

source: Return whether the term is an IRI reference.
fr: Indique si le terme est une référence d’IRI.

source: Return whether the term is a labeled blank node.
fr: Indique si le term est un nœud blanc labellisé.

source: Return whether the term is a literal.
fr: Indique si le terme est un littéral.

source: Return whether the term is a typed literal.
fr: Indique si le terme est un littéral typé.

source: Return whether the term is a langstring.
fr: Indique si le terme est un langstring.

source: Skip start bytes, then fill the argument with the next bytes of the identifier or literal value. Return the total number of bytes required.
fr: Ignore les start premiers octets, puis remplit l’objet bytes avec les octets suivants de la valeur littérale. Retourne le nombre total d’octets requis.

source: Skip start bytes, then fill the argument with the next bytes of the namespace, type or langtag. Return the total number of bytes required.
fr: Ignore les start premiers octets, puis remplit l’objet bytes avec les octets suivants de l’espace de nom, du type ou du langtag. Retourne le nombre total d’octets requis.

source: Interpret the term as a literal number, and convert it to an integer.
fr: Interprète le terme comme un nombre littéral, et le convertit en entier.

source: Interpret the term as a literal number, and convert it to a floating point number.
fr: Interprète le terme comme un nombre littéral, et le convertit en flottant.

source: Interpret the term as a literal date, and return as a tuple the number of seconds since the epoch and the number of nanoseconds since the start of the second.
fr: Interprète le terme comme une date littérale, et retourne en un tuple le nombre de secondes depuis l’époque et le nombre de nanosecondes depuis le début de la seconde.

source: Compare the N3 representation of self and the other term. Return a negative value is self comes first, a positive value if self comes last, and 0 if they are equal.
fr: Compare la représentation N3 de self et de l’autre terme. Retourne un nombre négatif si self est classé devant, un nombre positif si self est classé après, et 0 s’ils sont égaux.

source: Set self to a term parsed from the argument. Return the number of bytes used in the argument.
fr: Parse l’argument et assigne self. Retourne le nombre d’octets utilisés dans l’argument.

source: Skip start bytes, then fill the argument with the next bytes of the N3 representation. Return the total number of bytes required.
fr: Ignore les start premiers octets, puis remplit l’objet bytes avec les octets suivants de la représentation N3. Retourne le nombre total d’octets requis.

source: Implementation of a RDF term: IRI reference, blank node, or literal.
fr: Implémentation d’un terme RDF : référence d’IRI, nœud blanc, ou littéral.

source: Set the statement subject.
fr: Modifie le sujet de la déclaration.

source: Set the statement predicate.
fr: Modifie le prédicat de la déclaration.

source: Set the statement object.
fr: Modifie l’objet de la déclaration.

source: Set the statement graph.
fr: Modifie le graphe de la déclaration.

source: Set the statement deletion_date.
fr: Modifie la date de suppression de la déclaration.

source: Unset the statement subject.
fr: Enlève le sujet de la déclaration.

source: Unset the statement predicate.
fr: Enlève le prédicat de la déclaration.

source: Unset the statement object.
fr: Enlève l’objet de la déclaration.

source: Unset the statement graph.
fr: Enlève le graphe de la déclaration.

source: Unset the statement deletion_date.
fr: Enlève la date de suppression de la déclaration.

source: Get the fields of the statement.
fr: Extrait les champs de la déclaration.

source: Compare the N3 representation of the terms in self and the terms in the other statement, in the specified lexicographic order. Return a negative value is self comes first, a positive value if self comes last, and 0 if they are equal.
fr: Compare la représentation N3 des termes de self et des termes de l’autre déclaration, dans l’ordre lexicographique spécifié. Retourne un nombre négatif si self est classé devant, un nombre positif si self est classé après, et 0 s’ils sont égaux.

source: Implementation of a RDF statement: subject, predicate, object, graph, and deletion date.
fr: Implémentation d’une déclaration RDF : sujet, prédicat, objet, graphe, et date de suppression.

source: Get the (odd) number of coefficients of the filter.
fr: Retourne le nombre (impair) de coefficients du filtre.

source: Get the coefficients of the filter as a list.
fr: Retourne la liste des coefficients du filtre.

source: Set up the filter as band-pass.
fr: Construit un filtre passe-bande.

source: Apply the filter.
fr: Applique le filtre.

source: Compute default transition bandwidth
fr: Calcule la bande de transition par défaut

source: Compute a default filter order
fr: Calcule l’ordre du filtre par défaut

source: Implementation of a finite impulse response filter.
fr: Implémentation d’un filtre à réponse finie.

source: Get the full URI for a Lytonepal concept
fr: Retourne l’URI complète d’un concept Lytonepal

source: Manipulate linked data in HDF5 ADF files
fr: Manipule des données liées dans des fichiers HDF5 ADF

source: Cannot open that file. Does the parent directory exist?
fr: Impossible d’ouvrir ce fichier. Est-ce que le dossier parent existe ?

source: Cannot open that file. Are you sure that this is an existing valid ADF file?
fr: Impossible d’ouvrir ce fichier. Est-ce que c’est un fichier ADF existant et valide ?

source: Cannot open that virtual file.
fr: Impossible d’ouvrir ce fichier virtuel.

source: Cannot generate a new EEG.
fr: Impossible de générer un nouvel EEG.

source: The file offset is negative.
fr: Le décalage du fichier est négatif.

source: Cannot look up data in the file.
fr: Impossible de chercher des données dans le fichier.

source: Cannot modify the file.
fr: Impossible de modifier le fichier.

source: No EEG data in the file.
fr: Pas de données EEG dans ce fichier.

source: No EEG time in the file.
fr: Pas de date EEG dans ce fichier.

source: A literal cannot have both a type and a langtag. Please choose.
fr: Un littéral ne peut pas avoir à la fois un type et un langtag. Veuillez choisir.

source: The term is not a number literal.
fr: Le terme n’est pas un nombre littéral.

source: The term is not a date literal.
fr: Le terme n’est pas un littéral de date.

source: The term is not in N3.
fr: Le terme n’est pas en N3.

source: Construct a new, empty term.
fr: Construit un nouveau terme vide.

source: Copy the other term.
fr: Copie le terme other.

source: Initialize the term as a blank term.
fr: Indique si le terme est un nœud vide.

source: Initialize the term as an IRIREF term.
fr: Indique si le terme est une référence d’IRI.

source: Initialize the term as a literal untagged string.
fr: Initialise le terme comme chaîne littérale non taggée.
